output/dag.dot
digraph equations {
    "CASCADE.x" -> "CASCADE.y1";
    "CASCADE.p1" -> "CASCADE.y1";
    "CASCADE.y1" -> "CASCADE.y2";
    "CASCADE.x" -> "CASCADE.y2";
    "CASCADE.p2" -> "CASCADE.y2";
    "CASCADE.y2" -> "CASCADE.y_final";
    "MATH_DEMO.t" -> "MATH_DEMO.y_damped";
    "MATH_DEMO.p1" -> "MATH_DEMO.y_damped";
    "MATH_DEMO.p3" -> "MATH_DEMO.y_damped";
    "MATH_DEMO.p2" -> "MATH_DEMO.y_damped";
    "MATH_DEMO.x" -> "MATH_DEMO.y_tanh";
    "MATH_DEMO.p1" -> "MATH_DEMO.y_tanh";
    "MATH_DEMO.x" -> "MATH_DEMO.theta";
    "MATH_DEMO.t" -> "MATH_DEMO.theta";
    "MATH_DEMO.x" -> "MATH_DEMO.y_round";
    "MATH_DEMO.t" -> "MATH_DEMO.y_round";
    "MATH_DEMO.x" -> "MATH_DEMO.y_sign";
    "MATH_DEMO.x" -> "MATH_DEMO.y_log";
    "MATH_DEMO.t" -> "MATH_DEMO.y_log";
    "MATH_DEMO.x" -> "MATH_DEMO.y_relu";
    "MATH_DEMO.t" -> "MATH_DEMO.y_mod";
    "MATH_DEMO.x" -> "MATH_DEMO.y_asin";
    "MATH_DEMO.t" -> "MATH_DEMO.y_exp";
    "MATH_DEMO.p3" -> "MATH_DEMO.y_exp";
    "PHOTO.reserve_ratio" -> "PHOTO.Pmax_l";
    "PHOTO.p1" -> "PHOTO.Pmax_l";
    "PHOTO.p2" -> "PHOTO.Pmax_l";
    "PHOTO.Pmax_l" -> "PHOTO.A_leaf";
    "PHOTO.ppfd" -> "PHOTO.A_leaf";
    "PHOTO.p3" -> "PHOTO.A_leaf";
    "PHOTO.p4" -> "PHOTO.A_leaf";
}
